Repository: ViffyGwaanl/papertok-reader
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# ai.tool.builtin.notes_search.description
source: Search notes by keyword, book ID, or date range. Returns matching annotations.
zh_hans: 按关键词、书籍 ID 或日期范围搜索笔记，返回匹配标注。
zh_hant: 依關鍵字、書籍 ID 或日期範圍搜尋筆記，回傳匹配標註。

# ai.tool.builtin.reading_history.name
source: Reading History
zh_hans: 阅读历史
zh_hant: 閱讀歷史

# ai.tool.builtin.reading_history.description
source: Query historical reading sessions with optional date range and book ID filters.
zh_hans: 查询历史阅读会话，可选日期范围和书籍 ID 过滤。
zh_hant: 查詢歷史閱讀工作階段，可選日期範圍與書籍 ID 篩選。

# ai.tool.builtin.semantic_search_current_book.name
source: Current Book Semantic Search
zh_hans: 当前书籍语义搜索
zh_hant: 目前書籍語意搜尋

# ai.tool.builtin.semantic_search_current_book.description
source: Vector embedding + keyword hybrid search within the currently reading book. Requires pre-built index.
zh_hans: 在当前书籍中执行向量与关键词混合搜索，需要预建索引。
zh_hant: 在目前書籍中執行向量與關鍵字混合搜尋，需要預先建立索引。

# ai.tool.builtin.semantic_search_library.name
source: Library Semantic Search
zh_hans: 全库语义搜索
zh_hant: 全庫語意搜尋

# ai.tool.builtin.semantic_search_library.description
source: Hybrid vector+BM25 search across the entire library. Requires pre-built RAG index.
zh_hans: 在整个书库中执行向量与 BM25 混合搜索，需要预建 RAG 索引。
zh_hant: 在整個書庫中執行向量與 BM25 混合搜尋，需要預先建立 RAG 索引。

# ai.tool.builtin.calendar_list_calendars.name
source: List Calendars
zh_hans: 列出日历
zh_hant: 列出行事曆

# ai.tool.builtin.calendar_list_calendars.description
source: List all device calendars with their ID, title, and color.
zh_hans: 列出设备上的所有日历及其 ID、标题和颜色。
zh_hant: 列出裝置上的所有行事曆及其 ID、標題與顏色。

# ai.tool.builtin.calendar_list_events.name
source: List Calendar Events
zh_hans: 列出日历事件
zh_hant: 列出行事曆事件

# ai.tool.builtin.calendar_list_events.description
source: List events from a calendar within a date range.
zh_hans: 列出指定日期范围内某个日历的事件。
zh_hant: 列出指定日期範圍內某個行事曆的事件。

# ai.tool.builtin.calendar_get_event.name
source: Get Calendar Event
zh_hans: 获取日历事件
zh_hant: 取得行事曆事件

# ai.tool.builtin.calendar_get_event.description
source: Get details of a specific calendar event by ID.
zh_hans: 根据 ID 获取日历事件详情。
zh_hant: 依 ID 取得行事曆事件詳情。

# ai.tool.builtin.calendar_create_event.name
source: Create Calendar Event
zh_hans: 创建日历事件
zh_hant: 建立行事曆事件

# ai.tool.builtin.calendar_create_event.description
source: Create a new calendar event with title, start/end time, location, and notes.
zh_hans: 创建新的日历事件，可设置标题、开始/结束时间、地点和备注。
zh_hant: 建立新的行事曆事件，可設定標題、開始/結束時間、地點與備註。

# ai.tool.builtin.calendar_update_event.name
source: Update Calendar Event
zh_hans: 更新日历事件
zh_hant: 更新行事曆事件

# ai.tool.builtin.calendar_update_event.description
source: Update an existing calendar event by ID.
zh_hans: 根据 ID 更新已有日历事件。
zh_hant: 依 ID 更新現有行事曆事件。

# ai.tool.builtin.calendar_delete_event.name
source: Delete Calendar Event
zh_hans: 删除日历事件
zh_hant: 刪除行事曆事件

# ai.tool.builtin.calendar_delete_event.description
source: Delete a calendar event by ID.
zh_hans: 根据 ID 删除日历事件。
zh_hant: 依 ID 刪除行事曆事件。

# ai.tool.builtin.reminders_list_lists.name
source: List Reminder Lists
zh_hans: 列出提醒事项列表
zh_hant: 列出提醒事項列表

# ai.tool.builtin.reminders_list_lists.description
source: List all Reminders lists on the device.
zh_hans: 列出设备上的所有提醒事项列表。
zh_hant: 列出裝置上的所有提醒事項列表。

# ai.tool.builtin.reminders_list.name
source: List Reminders
zh_hans: 列出提醒事项
zh_hant: 列出提醒事項

# ai.tool.builtin.reminders_list.description
source: List reminders from a specific list, optionally filtered by completion status.
zh_hans: 列出某个提醒事项列表中的内容，可按完成状态过滤。
zh_hant: 列出某個提醒事項列表中的內容，可依完成狀態篩選。

# ai.tool.builtin.reminders_get.name
source: Get Reminder
zh_hans: 获取提醒事项
zh_hant: 取得提醒事項

# ai.tool.builtin.reminders_get.description
source: Get details of a specific reminder by ID.
zh_hans: 根据 ID 获取提醒事项详情。
zh_hant: 依 ID 取得提醒事項詳情。

# ai.tool.builtin.reminders_create.name
source: Create Reminder
zh_hans: 创建提醒事项
zh_hant: 建立提醒事項

# ai.tool.builtin.reminders_create.description
source: Create a new reminder with title, due date, priority, and notes.
zh_hans: 创建新的提醒事项，可设置标题、截止时间、优先级和备注。
zh_hant: 建立新的提醒事項，可設定標題、截止時間、優先順序與備註。

# ai.tool.builtin.reminders_update.name
source: Update Reminder
zh_hans: 更新提醒事项
zh_hant: 更新提醒事項

# ai.tool.builtin.reminders_update.description
source: Update an existing reminder by ID.
zh_hans: 根据 ID 更新已有提醒事项。
zh_hant: 依 ID 更新現有提醒事項。

# ai.tool.builtin.reminders_delete.name
source: Delete Reminder
zh_hans: 删除提醒事项
zh_hant: 刪除提醒事項

# ai.tool.builtin.reminders_delete.description
source: Delete a reminder by ID.
zh_hans: 根据 ID 删除提醒事项。
zh_hant: 依 ID 刪除提醒事項。

# ai.tool.builtin.reminders_complete.name
source: Complete Reminder
zh_hans: 标记提醒已完成
zh_hant: 標記提醒為已完成

# ai.tool.builtin.reminders_complete.description
source: Mark a reminder as completed.
zh_hans: 将提醒事项标记为已完成。
zh_hant: 將提醒事項標記為已完成。

# ai.tool.builtin.reminders_uncomplete.name
source: Reopen Reminder
zh_hans: 标记提醒未完成
zh_hant: 標記提醒為未完成

# ai.tool.builtin.reminders_uncomplete.description
source: Mark a completed reminder as not completed.
zh_hans: 将已完成的提醒事项标记为未完成。
zh_hant: 將已完成的提醒事項標記為未完成。

# ai.tool.builtin.reminders_list_create.name
source: Create Reminder List
zh_hans: 创建提醒事项列表
zh_hant: 建立提醒事項列表

# ai.tool.builtin.reminders_list_create.description
source: Create a new Reminders list.
zh_hans: 创建新的提醒事项列表。
zh_hant: 建立新的提醒事項列表。

# ai.tool.builtin.reminders_list_delete.name
source: Delete Reminder List
zh_hans: 删除提醒事项列表
zh_hant: 刪除提醒事項列表

# ai.tool.builtin.reminders_list_delete.description
source: Delete a Reminders list by ID.
zh_hans: 根据 ID 删除提醒事项列表。
zh_hant: 依 ID 刪除提醒事項列表。

# ai.tool.builtin.reminders_list_rename.name
source: Rename Reminder List
zh_hans: 重命名提醒事项列表
zh_hant: 重新命名提醒事項列表

# ai.tool.builtin.reminders_list_rename.description
source: Rename a Reminders list.
zh_hans: 重命名提醒事项列表。
zh_hant: 重新命名提醒事項列表。

# ai.tool.builtin.memory_read.name
source: Read Memory
zh_hans: 读取记忆
zh_hant: 讀取記憶

# ai.tool.builtin.memory_read.description
source: Read markdown memory files: MEMORY.md (long-term) or YYYY-MM-DD.md (daily notes).
zh_hans: 读取 Markdown 记忆文件，例如长期记忆 MEMORY.md 或每日笔记。
zh_hant: 讀取 Markdown 記憶檔案，例如長期記憶 MEMORY.md 或每日筆記。

# ai.tool.builtin.memory_write.name
source: Write Memory
zh_hans: 写入记忆
zh_hant: 寫入記憶

# ai.tool.builtin.memory_write.description
source: Write or append to markdown memory files (MEMORY.md or daily notes).
zh_hans: 写入或追加 Markdown 记忆文件，例如 MEMORY.md 或每日笔记。
zh_hant: 寫入或追加 Markdown 記憶檔案，例如 MEMORY.md 或每日筆記。

# ai.tool.builtin.memory_search.name
source: Search Memory
zh_hans: 搜索记忆
zh_hant: 搜尋記憶

# ai.tool.builtin.memory_search.description
source: Search memory files by keyword or date range.
zh_hans: 按关键词或日期范围搜索记忆文件。
zh_hant: 依關鍵字或日期範圍搜尋記憶檔案。

# ai.tool.builtin.spawn_sub_agent.name
source: Spawn Sub-Agent
zh_hans: 生成子代理
zh_hant: 產生子代理

# ai.tool.builtin.spawn_sub_agent.description
source: Spawn a focused sub-agent (research, summarize, verify) with a restricted tool set and limited steps.
zh_hans: 生成一个聚焦型子代理（研究、总结、验证），带受限工具集和步数限制。
zh_hant: 產生一個聚焦型子代理（研究、總結、驗證），附帶受限工具集與步數限制。

# ai.tool.builtin.shortcuts_run.name
source: Run Shortcut
zh_hans: 运行快捷指令
zh_hant: 執行捷徑

# ai.tool.builtin.shortcuts_run.description
source: Run an iOS Shortcut by name via x-callback-url. High risk: executes arbitrary user shortcuts.
zh_hans: 通过 x-callback-url 按名称运行 iOS 快捷指令；高风险，会执行任意用户快捷指令。
zh_hant: 透過 x-callback-url 依名稱執行 iOS 捷徑；高風險，會執行任意使用者捷徑。

# errors.memory.candidate_not_found
source: The selected memory item could not be found.
zh_hans: 找不到所选记忆条目。
zh_hant: 找不到所選記憶項目。

# errors.memory.document_not_found
source: The selected memory document could not be found.
zh_hans: 找不到所选记忆文档。
zh_hant: 找不到所選記憶文件。

# errors.memory.empty_text
source: Memory text cannot be empty.
zh_hans: 记忆内容不能为空。
zh_hant: 記憶內容不能為空。

# errors.memory.review_inbox_unavailable
source: Memory review items are unavailable right now.
zh_hans: 待审记忆暂时不可用。
zh_hant: 待審記憶暫時無法使用。

# memory.action.add_to_inbox
source: Add to Inbox
zh_hans: 加入待审箱
zh_hant: 加入待審箱

# memory.action.dismiss
source: Dismiss
zh_hans: 忽略
zh_hant: 忽略

# memory.action.save_daily
source: Save to Daily
zh_hans: 存入今日日记
zh_hant: 存入今日日記

# memory.action.save_long_term
source: Save to Long-Term
zh_hans: 存入长期记忆
zh_hant: 存入長期記憶

# memory.action.save_now
source: Save Now
zh_hans: 立即保存
zh_hant: 立即儲存

# memory.capture.description
source: Capture a note now, then either send it to the review inbox or write it straight into memory.
zh_hans: 现在记录一条内容，可以先送入待审箱，也可以直接写入记忆。
zh_hant: 現在記錄一條內容，可以先送入待審箱，也可以直接寫入記憶。

# memory.capture.target
source: Destination
zh_hans: 保存位置
zh_hant: 儲存位置

# memory.empty.documents.subtitle
source: Create today's note or save something to long-term memory to start organizing.
zh_hans: 创建今日日记，或先写入一条长期记忆，整理入口就会出现。
zh_hant: 建立今日日記，或先寫入一條長期記憶，整理入口就會出現。

# memory.empty.documents.title
source: No memory documents yet
zh_hans: 还没有记忆文档
zh_hant: 還沒有記憶文件

# memory.empty.review.subtitle
source: New candidates from chat, reading, and manual capture will appear here for review.
zh_hans: 新的聊天、阅读和手动捕获候选记忆会先进入这里，等你审核。
zh_hant: 新的聊天、閱讀和手動擷取候選記憶會先進入這裡，等你審核。

# memory.empty.review.title
source: Review inbox is clear
zh_hans: 待审箱已清空
zh_hant: 待審箱已清空

# memory.empty.search.subtitle
source: Search across long-term memory and daily notes to jump straight back into context.
zh_hans: 在长期记忆和今日日记里统一搜索，直接回到对应上下文。
zh_hant: 在長期記憶和今日日記裡統一搜尋，直接回到對應上下文。

# memory.empty.search.title
source: No search results yet
zh_hans: 还没有搜索结果
zh_hant: 還沒有搜尋結果

# memory.filter.applied
source: Applied
zh_hans: 已应用
zh_hant: 已套用

# memory.filter.dismissed
source: Dismissed
zh_hans: 已忽略
zh_hant: 已忽略

# memory.filter.pending
source: Pending
zh_hans: 待审核
zh_hant: 待審核

# memory.header.subtitle
source: Review memory candidates, edit daily notes, search long-term context, and capture durable facts.
zh_hans: 在这里统一审核候选记忆、编辑今日日记、搜索长期上下文，并手动保存长期信息。
zh_hant: 在這裡統一審核候選記憶、編輯今日日記、搜尋長期上下文，並手動儲存長期資訊。

# memory.header.title
source: Memory Workspace
zh_hans: 记忆工作台
zh_hant: 記憶工作台

# memory.search.placeholder
source: Search memory
zh_hans: 搜索记忆
zh_hant: 搜尋記憶

# memory.section.capture
source: Capture
zh_hans: 捕获
zh_hant: 擷取

# memory.section.documents
source: Documents
zh_hans: 文档
zh_hant: 文件

# memory.section.review
source: Review
zh_hans: 审核
zh_hant: 審核

# memory.section.search
source: Search
zh_hans: 搜索
zh_hant: 搜尋

# memory.target.daily
source: Daily
zh_hans: 今日日记
zh_hant: 今日日記

# memory.target.long_term
source: Long-Term
zh_hans: 长期记忆
zh_hant: 長期記憶

# memory.context.header_body
source: The following notes were recorded in previous sessions. Use them to maintain continuity, but do not mention them unless relevant to the user's request.
zh_hans: 以下内容记录于之前的会话中，可用于保持连续上下文；只有在与用户当前请求相关时才提及。
zh_hant: 以下內容記錄於之前的會話中，可用於保持連續上下文；只有在與使用者目前請求相關時才提及。

# memory.context.header_title
source: Persistent memory context
zh_hans: 记忆上下文
zh_hant: 記憶上下文

# memory.document.daily_title_format
source: Daily memory · %@
zh_hans: 每日记忆 · %@
zh_hant: 每日記憶 · %@

# memory.document.long_term_title
source: Long-term memory
zh_hans: 长期记忆
zh_hant: 長期記憶

# memory.document.session_digest_title_format
source: Session digest · %@
zh_hans: 会话摘要 · %@
zh_hant: 會話摘要 · %@

# intent.create_note.parameter.book_title
source: Book Title
zh_hans: 书名
zh_hant: 書名

# intent.create_note.parameter.color
source: Color
zh_hans: 颜色
zh_hant: 顏色

# intent.create_note.parameter.note_text
source: Note Text
zh_hans: 笔记内容
zh_hant: 筆記內容

# memory.context.truncated_suffix
source: …(truncated)
zh_hans: …（已截断）
zh_hant: …（已截斷）

# settings.share_shortcuts
source: Share & Shortcuts
zh_hans: 共享与快捷指令
zh_hant: 共享與捷徑

# share.settings.cleanup_after_use
source: Remove After Success
zh_hans: 成功后移除
zh_hant: 成功後移除

# share.settings.cleanup_after_use.footer
source: Turn this off to keep successful share events for diagnostics until they expire.
zh_hans: 关闭后，成功处理的共享事件会保留到过期为止，便于诊断。
zh_hant: 關閉後，成功處理的共享事件會保留到過期為止，便於診斷。

# share.settings.cleanup_expired
source: Clean Up Expired Events
zh_hans: 清理过期事件
zh_hant: 清理過期事件

# share.settings.cleanup_result_format
source: Removed %lld expired events
zh_hans: 已清理 %lld 个过期事件
zh_hant: 已清理 %lld 個過期事件

# share.settings.default_route
source: Default Route
zh_hans: 默认去向
zh_hant: 預設去向

# share.settings.default_route.footer
source: Choose where shared content goes by default. Book files still go to Bookshelf when required.
zh_hans: 选择共享内容默认进入的位置；书籍文件在需要时仍会进入书架。
zh_hant: 選擇共享內容預設進入的位置；書籍檔案在需要時仍會進入書架。

# share.settings.diagnostics.event_summary_format
source: %lld files, %lld text items, %lld links
zh_hans: %lld 个文件，%lld 段文本，%lld 个链接
zh_hant: %lld 個檔案，%lld 段文字，%lld 個連結

# share.settings.diagnostics.latest_event
source: Latest Event
zh_hans: 最近事件
zh_hant: 最近事件

# share.settings.diagnostics.no_events
source: No recent share events
zh_hans: 最近没有共享事件
zh_hant: 最近沒有共享事件

# share.settings.diagnostics.pending_events
source: Pending Events
zh_hans: 待处理事件
zh_hant: 待處理事件

# share.settings.diagnostics.retention
source: Retention
zh_hans: 保留时间
zh_hant: 保留時間

# share.settings.retention_period
source: Retention Period
zh_hans: 保留期限
zh_hant: 保留期限

# share.settings.route.ask
source: Ask Every Time
zh_hans: 每次询问
zh_hant: 每次詢問

# share.settings.route.auto
source: Automatic
zh_hans: 自动
zh_hant: 自動

# tab.memory
source: Memory
zh_hans: 记忆
zh_hant: 記憶

# reader.search.bar.placeholder
source: Search this book…
zh_hans: 搜索本书…
zh_hant: 搜尋本書…

# reader.search.prev
source: Previous result
zh_hans: 上一个结果
zh_hant: 上一個結果

# reader.search.next
source: Next result
zh_hans: 下一个结果
zh_hant: 下一個結果

# reader.search.no_results
source: No results found
zh_hans: 未找到结果
zh_hant: 找不到結果

# reader.search.clear
source: Clear search
zh_hans: 清除搜索
zh_hant: 清除搜尋
